//Домашене задание:
//    1. Сделать функцию, которая через функцию prompt просит ввести неограниченное количество чисел (пока не введем 0)
//    далее суммирует их и выводит

//2. Сделать функцию, которая принимает два числа разделенных запятой и возводит первое число в степерь 2. Например:
//   Ввели: "2,3" возводим 2 в 3 степень = 8

//3. Для написанных ранее классов Product, Phone, Computer сделать наполнение через prompt в цикле. При этом, сделать
//   проверку на тип объекта (typeof)и в зависимости от типа объекта справшивать разные данны.
//   Например, если это phone то в 
//   prompt писать "введите размер экрана (screen_size)".
//   Добавить для Product свойство created_at (дата производства) и заполнять его случайной датой от начала до конца 2017 года
//   Сделать вывод форматированным (дату в формате toLocaleString(), числа (цена) округленные до целых)

// 1) ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//var sum = 0;
//var c;
//function func(){
//    if (c != 0) {
//        while (c = parseFloat(prompt("Enter your number:"))) {
//            sum += c;
//        }
//        alert("Sum=" + sum);
//    }
//}
//func();

// 2) ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//var index = 0; 

//function func() {
//    c = parseFloat(prompt("Enter first number:"))
//    index++;
//    d = parseFloat(prompt("Enter second number:"))
//    index++;
//    if (index == 2) {
//        var result = Math.pow(c, d);
//        alert("Power is: " + result);
//    }
//}

//func();

// 3) ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

